{
    "en": {
        "nav_home": "Home",
        "nav_services": "Services",
        "nav_why_us": "Why Etern8",
        "nav_portfolio": "Portfolio",
        "nav_about": "About Us",
        "nav_contact": "Contact",
        "hero_headline": "Innovate. Build. Grow. Your Digital Future Starts with Etern8.",
        "hero_subheadline": "We craft cutting-edge applications, websites, AI solutions, and impactful designs that elevate your brand and accelerate your success in the UAE, KSA, Russia, and beyond.",
        "hero_cta": "Get a Free Quote",
        "services_headline": "Our Expertise, Your Advantage",
        "services_intro": "Etern8 delivers a comprehensive suite of digital services, leveraging global talent and cutting-edge technology to bring your vision to life.",
        "service1_title": "Application Development",
        "service1_desc": "We build intuitive and scalable mobile (iOS & Android, native & cross-platform) and web applications (PWAs, SPAs) that engage users and drive business objectives.",
        "service2_title": "Website Development",
        "service2_desc": "From dynamic corporate websites with robust CMS to high-performance e-commerce platforms and conversion-focused landing pages, we create digital experiences that captivate and convert.",
        "service3_title": "AI Solutions",
        "service3_desc": "Unlock the power of Artificial Intelligence. We develop custom AI models, intelligent chatbots, data-driven analytics, and automation tools to optimize your operations and provide a competitive edge.",
        "service4_title": "Design (UI/UX & Branding)",
        "service4_desc": "Our creative team crafts stunning UI/UX designs for web and mobile, develops memorable branding and identity packages, and produces compelling marketing collateral that resonates with your audience.",
        "service5_title": "Digital Advertising & Marketing",
        "service5_desc": "Amplify your reach with our data-driven digital marketing strategies, including SMM, SEO/SEM, content marketing, and performance campaigns designed to maximize ROI.",
        "why_etern8_headline": "The Etern8 Difference: Innovation, Quality, Global Reach",
        "why_etern8_point1_title": "Global Talent, Local Expertise",
        "why_etern8_point1_desc": "We harness the skills of top-tier freelance talent from cost-effective regions like India and Russia, combined with a deep understanding of lucrative markets such as the UAE, KSA, and Russia. This unique model ensures premium quality at competitive prices.",
        "why_etern8_point2_title": "Future-Focused Technology",
        "why_etern8_point2_desc": "Etern8 is committed to leveraging the latest advancements in web development, AI, and design to deliver solutions that are not just current but also future-proof, giving your business a sustainable advantage.",
        "why_etern8_point3_title": "Client-Centric Approach",
        "why_etern8_point3_desc": "Your success is our priority. We work collaboratively with you, ensuring transparent communication and a tailored approach to meet your specific business goals and market needs.",
        "why_etern8_point4_title": "Results-Driven Solutions",
        "why_etern8_point4_desc": "We focus on delivering tangible results – whether it's increased engagement, higher conversions, or streamlined operations. Our solutions are designed to make a measurable impact on your bottom line.",
        "portfolio_headline": "Our Vision in Action (Conceptual)",
        "portfolio_intro": "While we are a new venture assembling our portfolio, our vision is clear. We aim to deliver projects that showcase innovation, strategic thinking, and exceptional execution. Below are conceptual examples of the caliber of work Etern8 will produce.",
        "portfolio_item1_title": "Conceptual Project Title 1",
        "portfolio_item1_desc": "Highlighting the challenge, our approach, and envisioned outcome for a luxury brand in UAE.",
        "portfolio_item2_title": "Conceptual Project Title 2",
        "portfolio_item2_desc": "AI-powered logistics solution for a KSA enterprise.",
        "about_headline": "Meet Etern8: Redefining Digital Excellence",
        "about_story_title": "Our Story",
        "about_story_desc": "Etern8 was founded with a bold vision: to bridge the gap between world-class digital talent and businesses seeking transformative solutions. We believe in the power of a global, agile team to deliver exceptional value and innovation.",
        "about_mission_title": "Our Mission",
        "about_mission_desc": "To empower businesses in the UAE, KSA, Russia, and globally with cutting-edge, cost-effective digital products and services that drive growth and define the future.",
        "about_model_title": "Our Model",
        "about_model_desc": "We operate on a lean, flexible model, curating teams of highly skilled freelancers from India, Russia, and other talent-rich regions. This allows us to offer unparalleled expertise and competitive pricing, focusing on delivering premium results for clients in high-growth markets.",
        "testimonials_headline": "What Our Future Clients Will Say",
        "testimonials_intro": "We are dedicated to building lasting partnerships and exceeding expectations. We look forward to sharing testimonials from satisfied clients here soon.",
        "testimonial1_text": "\"Etern8 delivered an exceptional product on time and on budget. Their team was professional and highly skilled.\"",
        "testimonial1_author": "- Future Client, Tech Startup",
        "testimonial2_text": "\"Working with Etern8 was a game-changer for our business. Their innovative solutions helped us reach new heights.\"",
        "testimonial2_author": "- Future Client, E-commerce Business",
        "contact_headline": "Ready to Start Your Next Project?",
        "contact_subheadline": "Let's discuss how Etern8 can help you achieve your digital ambitions. Contact us today for a free consultation and quote.",
        "contact_form_name": "Name",
        "contact_form_email": "Email",
        "contact_form_company": "Company (Optional)",
        "contact_form_service_placeholder": "Service of Interest",
        "contact_form_service_option_default": "Service of Interest",
        "contact_form_service_option_app": "Application Development",
        "contact_form_service_option_web": "Website Development",
        "contact_form_service_option_ai": "AI Solutions",
        "contact_form_service_option_design": "Design",
        "contact_form_service_option_adv": "Advertising",
        "contact_form_service_option_other": "Other",
        "contact_form_message": "Project Details",
        "contact_form_submit": "Submit",
        "contact_email_label": "Email:",
        "footer_copyright": "Copyright © 2025 Etern8. All Rights Reserved.",
        "footer_privacy": "Privacy Policy",
        "footer_terms": "Terms of Service",
        "footer_domain": "etern8.tech"
    },
    "ru": {
        "nav_home": "Главная",
        "nav_services": "Услуги",
        "nav_why_us": "Почему Etern8",
        "nav_portfolio": "Портфолио",
        "nav_about": "О нас",
        "nav_contact": "Контакты",
        "hero_headline": "Инновации. Разработка. Рост. Ваше цифровое будущее начинается с Etern8.",
        "hero_subheadline": "Мы создаем передовые приложения, веб-сайты, AI-решения и впечатляющий дизайн, которые повышают узнаваемость вашего бренда и ускоряют ваш успех в ОАЭ, Саудовской Аравии, России и за ее пределами.",
        "hero_cta": "Получить бесплатную консультацию",
        "services_headline": "Наша экспертиза, ваше преимущество",
        "services_intro": "Etern8 предоставляет полный комплекс цифровых услуг, используя таланты со всего мира и передовые технологии для воплощения вашего видения в жизнь.",
        "service1_title": "Разработка приложений",
        "service1_desc": "Мы создаем интуитивно понятные и масштабируемые мобильные (iOS & Android, нативные и кроссплатформенные) и веб-приложения (PWA, SPA), которые вовлекают пользователей и способствуют достижению бизнес-целей.",
        "service2_title": "Разработка веб-сайтов",
        "service2_desc": "От динамичных корпоративных сайтов с надежной CMS до высокопроизводительных e-commerce платформ и конверсионных лендингов — мы создаем цифровые решения, которые привлекают и превращают посетителей в клиентов.",
        "service3_title": "AI-решения",
        "service3_desc": "Раскройте потенциал искусственного интеллекта. Мы разрабатываем кастомные AI-модели, интеллектуальные чат-боты, аналитику на основе данных и инструменты автоматизации для оптимизации ваших операций и обеспечения конкурентного преимущества.",
        "service4_title": "Дизайн (UI/UX и Брендинг)",
        "service4_desc": "Наша креативная команда разрабатывает потрясающие UI/UX дизайны для веб и мобильных устройств, создает запоминающиеся брендинговые и айдентика-пакеты, а также производит убедительные маркетинговые материалы, которые находят отклик у вашей аудитории.",
        "service5_title": "Цифровая реклама и маркетинг",
        "service5_desc": "Расширьте свой охват с помощью наших цифровых маркетинговых стратегий, основанных на данных, включая SMM, SEO/SEM, контент-маркетинг и перформанс-кампании, нацеленные на максимизацию ROI.",
        "why_etern8_headline": "Преимущества Etern8: Инновации, Качество, Глобальный охват",
        "why_etern8_point1_title": "Глобальные таланты, локальная экспертиза",
        "why_etern8_point1_desc": "Мы используем навыки лучших фрилансеров из экономически выгодных регионов, таких как Индия и Россия, в сочетании с глубоким пониманием прибыльных рынков, таких как ОАЭ, Саудовская Аравия и Россия. Эта уникальная модель обеспечивает премиальное качество по конкурентоспособным ценам.",
        "why_etern8_point2_title": "Технологии будущего",
        "why_etern8_point2_desc": "Etern8 стремится использовать последние достижения в веб-разработке, AI и дизайне для предоставления решений, которые не только актуальны, но и ориентированы на будущее, обеспечивая вашему бизнесу устойчивое преимущество.",
        "why_etern8_point3_title": "Клиентоориентированный подход",
        "why_etern8_point3_desc": "Ваш успех — наш приоритет. Мы работаем в тесном сотрудничестве с вами, обеспечивая прозрачную коммуникацию и индивидуальный подход для достижения ваших конкретных бизнес-целей и потребностей рынка.",
        "why_etern8_point4_title": "Решения, ориентированные на результат",
        "why_etern8_point4_desc": "Мы фокусируемся на достижении ощутимых результатов — будь то повышение вовлеченности, увеличение конверсии или оптимизация операций. Наши решения призваны оказать измеримое влияние на вашу прибыль.",
        "portfolio_headline": "Наше видение в действии (Концептуально)",
        "portfolio_intro": "Хотя мы — новый проект, формирующий свое портфолио, наше видение ясно. Мы стремимся реализовывать проекты, демонстрирующие инновации, стратегическое мышление и исключительное исполнение. Ниже представлены концептуальные примеры уровня работ, которые будет создавать Etern8.",
        "portfolio_item1_title": "Концептуальное название проекта 1",
        "portfolio_item1_desc": "Освещение проблемы, нашего подхода и предполагаемого результата для люксового бренда в ОАЭ.",
        "portfolio_item2_title": "Концептуальное название проекта 2",
        "portfolio_item2_desc": "AI-решение для логистики предприятия в Саудовской Аравии.",
        "about_headline": "Знакомьтесь с Etern8: Переосмысление цифрового совершенства",
        "about_story_title": "Наша история",
        "about_story_desc": "Компания Etern8 была основана со смелым видением: преодолеть разрыв между цифровыми талантами мирового класса и бизнесом, ищущим трансформационные решения. Мы верим в силу глобальной, гибкой команды для предоставления исключительной ценности и инноваций.",
        "about_mission_title": "Наша миссия",
        "about_mission_desc": "Предоставлять компаниям в ОАЭ, Саудовской Аравии, России и по всему миру передовые, экономически эффективные цифровые продукты и услуги, которые стимулируют рост и определяют будущее.",
        "about_model_title": "Наша модель",
        "about_model_desc": "Мы работаем по гибкой модели, формируя команды высококвалифицированных фрилансеров из Индии, России и других регионов, богатых талантами. Это позволяет нам предлагать непревзойденную экспертизу и конкурентоспособные цены, фокусируясь на предоставлении премиальных результатов для клиентов на быстрорастущих рынках.",
        "testimonials_headline": "Что скажут наши будущие клиенты",
        "testimonials_intro": "Мы стремимся строить долгосрочные партнерские отношения и превосходить ожидания. Мы с нетерпением ждем возможности поделиться здесь отзывами довольных клиентов в ближайшее время.",
        "testimonial1_text": "\"Etern8 предоставили исключительный продукт в срок и в рамках бюджета. Их команда была профессиональной и высококвалифицированной.\"",
        "testimonial1_author": "- Будущий клиент, Технологический стартап",
        "testimonial2_text": "\"Работа с Etern8 изменила правила игры для нашего бизнеса. Их инновационные решения помогли нам достичь новых высот.\"",
        "testimonial2_author": "- Будущий клиент, E-commerce бизнес",
        "contact_headline": "Готовы начать ваш следующий проект?",
        "contact_subheadline": "Давайте обсудим, как Etern8 может помочь вам достичь ваших цифровых амбиций. Свяжитесь с нами сегодня для бесплатной консультации и расчета стоимости.",
        "contact_form_name": "Имя",
        "contact_form_email": "Email",
        "contact_form_company": "Компания (Необязательно)",
        "contact_form_service_placeholder": "Интересующая услуга",
        "contact_form_service_option_default": "Интересующая услуга",
        "contact_form_service_option_app": "Разработка приложений",
        "contact_form_service_option_web": "Разработка веб-сайтов",
        "contact_form_service_option_ai": "AI-решения",
        "contact_form_service_option_design": "Дизайн",
        "contact_form_service_option_adv": "Реклама",
        "contact_form_service_option_other": "Другое",
        "contact_form_message": "Детали проекта",
        "contact_form_submit": "Отправить",
        "contact_email_label": "Email:",
        "footer_copyright": "Copyright © 2025 Etern8. Все права защищены.",
        "footer_privacy": "Политика конфиденциальности",
        "footer_terms": "Условия использования",
        "footer_domain": "etern8.tech"
    },
    "ar": {
        "nav_home": "الرئيسية",
        "nav_services": "الخدمات",
        "nav_why_us": "لماذا Etern8",
        "nav_portfolio": "أعمالنا",
        "nav_about": "من نحن",
        "nav_contact": "اتصل بنا",
        "hero_headline": "ابتكر. ابنِ. انطلق. مستقبلك الرقمي يبدأ مع Etern8.",
        "hero_subheadline": "نصنع تطبيقات ومواقع ويب وحلول ذكاء اصطناعي وتصميمات مؤثرة ترتقي بعلامتك التجارية وتسرع نجاحك في الإمارات العربية المتحدة والمملكة العربية السعودية وروسيا وخارجها.",
        "hero_cta": "احصل على عرض سعر مجاني",
        "services_headline": "خبرتنا، ميزتك التنافسية",
        "services_intro": "تقدم Etern8 مجموعة شاملة من الخدمات الرقمية، مستفيدة من المواهب العالمية وأحدث التقنيات لتحويل رؤيتك إلى واقع ملموس.",
        "service1_title": "تطوير التطبيقات",
        "service1_desc": "نقوم ببناء تطبيقات جوال (iOS و Android، أصلية ومتعددة المنصات) وتطبيقات ويب (PWA و SPA) سهلة الاستخدام وقابلة للتطوير، تشرك المستخدمين وتحقق أهداف عملك.",
        "service2_title": "تطوير مواقع الويب",
        "service2_desc": "من مواقع الشركات الديناميكية المزودة بأنظمة إدارة محتوى قوية إلى منصات التجارة الإلكترونية عالية الأداء وصفحات الهبوط التي تركز على التحويل، نبتكر تجارب رقمية تأسر وتحول الزوار إلى عملاء.",
        "service3_title": "حلول الذكاء الاصطناعي",
        "service3_desc": "أطلق العنان لقوة الذكاء الاصطناعي. نقوم بتطوير نماذج ذكاء اصطناعي مخصصة، وروبوتات محادثة ذكية، وتحليلات تعتمد على البيانات، وأدوات أتمتة لتحسين عملياتك وتوفير ميزة تنافسية.",
        "service4_title": "التصميم (واجهة المستخدم/تجربة المستخدم والعلامة التجارية)",
        "service4_desc": "يقوم فريقنا الإبداعي بصياغة تصميمات واجهة مستخدم/تجربة مستخدم مذهلة للويب والجوال، وتطوير باقات علامات تجارية وهوية لا تُنسى، وإنتاج مواد تسويقية مقنعة تلقى صدى لدى جمهورك.",
        "service5_title": "الإعلان والتسويق الرقمي",
        "service5_desc": "قم بتوسيع نطاق وصولك من خلال استراتيجيات التسويق الرقمي القائمة على البيانات، بما في ذلك التسويق عبر وسائل التواصل الاجتماعي، وتحسين محركات البحث/التسويق عبر محركات البحث، وتسويق المحتوى، وحملات الأداء المصممة لزيادة عائد الاستثمار إلى أقصى حد.",
        "why_etern8_headline": "اختلاف Etern8: الابتكار، الجودة، الانتشار العالمي",
        "why_etern8_point1_title": "مواهب عالمية، خبرة محلية",
        "why_etern8_point1_desc": "نستثمر مهارات أفضل المستقلين من المناطق ذات التكلفة المعقولة مثل الهند وروسيا، جنبًا إلى جنب مع فهم عميق للأسواق المربحة مثل الإمارات العربية المتحدة والمملكة العربية السعودية وروسيا. يضمن هذا النموذج الفريد جودة عالية بأسعار تنافسية.",
        "why_etern8_point2_title": "تكنولوجيا موجهة نحو المستقبل",
        "why_etern8_point2_desc": "تلتزم Etern8 بالاستفادة من أحدث التطورات في تطوير الويب والذكاء الاصطناعي والتصميم لتقديم حلول ليست حديثة فحسب، بل ومقاومة للمستقبل أيضًا، مما يمنح عملك ميزة مستدامة.",
        "why_etern8_point3_title": "نهج يركز على العميل",
        "why_etern8_point3_desc": "نجاحك هو أولويتنا. نعمل بالتعاون معك، ونضمن التواصل الشفاف والنهج المخصص لتلبية أهداف عملك واحتياجات السوق المحددة.",
        "why_etern8_point4_title": "حلول موجهة نحو النتائج",
        "why_etern8_point4_desc": "نركز على تقديم نتائج ملموسة - سواء كان ذلك زيادة في التفاعل، أو معدلات تحويل أعلى، أو عمليات مبسطة. تم تصميم حلولنا لإحداث تأثير قابل للقياس على أرباحك النهائية.",
        "portfolio_headline": "رؤيتنا قيد التنفيذ (تصوري)",
        "portfolio_intro": "بينما نحن مشروع جديد نقوم بتجميع ملف أعمالنا، فإن رؤيتنا واضحة. نهدف إلى تقديم مشاريع تعرض الابتكار والتفكير الاستراتيجي والتنفيذ الاستثنائي. فيما يلي أمثلة تصورية لنوعية العمل الذي ستنتجه Etern8.",
        "portfolio_item1_title": "عنوان مشروع تصوري 1",
        "portfolio_item1_desc": "تسليط الضوء على التحدي، نهجنا، والنتيجة المتوخاة لعلامة تجارية فاخرة في الإمارات.",
        "portfolio_item2_title": "عنوان مشروع تصوري 2",
        "portfolio_item2_desc": "حل لوجستي مدعوم بالذكاء الاصطناعي لمؤسسة في السعودية.",
        "about_headline": "تعرف على Etern8: إعادة تعريف التميز الرقمي",
        "about_story_title": "قصتنا",
        "about_story_desc": "تأسست Etern8 برؤية جريئة: سد الفجوة بين المواهب الرقمية العالمية والشركات التي تبحث عن حلول تحويلية. نؤمن بقوة الفريق العالمي المرن لتقديم قيمة وابتكار استثنائيين.",
        "about_mission_title": "مهمتنا",
        "about_mission_desc": "تمكين الشركات في الإمارات العربية المتحدة والمملكة العربية السعودية وروسيا والعالم من خلال منتجات وخدمات رقمية متطورة وفعالة من حيث التكلفة تدفع النمو وتحدد المستقبل.",
        "about_model_title": "نموذجنا",
        "about_model_desc": "نعمل وفقًا لنموذج مرن ورشيق، ونقوم بتنظيم فرق من المستقلين ذوي المهارات العالية من الهند وروسيا والمناطق الأخرى الغنية بالمواهب. يتيح لنا ذلك تقديم خبرة لا مثيل لها وأسعار تنافسية، مع التركيز على تقديم نتائج متميزة للعملاء في الأسواق عالية النمو.",
        "testimonials_headline": "ماذا سيقول عملاؤنا المستقبليون",
        "testimonials_intro": "نحن ملتزمون ببناء شراكات دائمة وتجاوز التوقعات. نتطلع إلى مشاركة شهادات العملاء الراضين هنا قريبًا.",
        "testimonial1_text": "\"قدمت Etern8 منتجًا استثنائيًا في الوقت المحدد وفي حدود الميزانية. كان فريقهم محترفًا وماهرًا للغاية.\"",
        "testimonial1_author": "- عميل مستقبلي، شركة ناشئة في مجال التكنولوجيا",
        "testimonial2_text": "\"كان العمل مع Etern8 بمثابة تغيير جذري لأعمالنا. ساعدتنا حلولهم المبتكرة في الوصول إلى آفاق جديدة.\"",
        "testimonial2_author": "- عميل مستقبلي، شركة تجارة إلكترونية",
        "contact_headline": "هل أنت مستعد لبدء مشروعك القادم؟",
        "contact_subheadline": "دعنا نناقش كيف يمكن لـ Etern8 مساعدتك في تحقيق طموحاتك الرقمية. اتصل بنا اليوم للحصول على استشارة مجانية وعرض أسعار.",
        "contact_form_name": "الاسم",
        "contact_form_email": "البريد الإلكتروني",
        "contact_form_company": "الشركة (اختياري)",
        "contact_form_service_placeholder": "الخدمة المطلوبة",
        "contact_form_service_option_default": "الخدمة المطلوبة",
        "contact_form_service_option_app": "تطوير التطبيقات",
        "contact_form_service_option_web": "تطوير مواقع الويب",
        "contact_form_service_option_ai": "حلول الذكاء الاصطناعي",
        "contact_form_service_option_design": "التصميم",
        "contact_form_service_option_adv": "الإعلان",
        "contact_form_service_option_other": "أخرى",
        "contact_form_message": "تفاصيل المشروع",
        "contact_form_submit": "إرسال",
        "contact_email_label": "البريد الإلكتروني:",
        "footer_copyright": "حقوق النشر © 2025 Etern8. جميع الحقوق محفوظة.",
        "footer_privacy": "سياسة الخصوصية",
        "footer_terms": "شروط الخدمة",
        "footer_domain": "etern8.tech"
    }
}

